INSERT INTO logistics_log (parcel_id, event_type, location_name, event_timestamp, weight_kg, distance_km) VALUES
('PKG-001', 'CREATED',   'Москва-Сортировочный', '2024-03-01 08:00:00', 5.2, 0),
('PKG-001', 'DEPARTED',  'Москва-Сортировочный', '2024-03-01 12:00:00', 5.2, 0),
('PKG-001', 'ARRIVED',   'Нижний Новгород ЛЦ',   '2024-03-01 18:00:00', 5.2, 420),
('PKG-001', 'DEPARTED',  'Нижний Новгород ЛЦ',   '2024-03-03 10:00:00', 5.2, 420), -- Простой 40 часов!
('PKG-001', 'ARRIVED',   'Казань-Центральный',   '2024-03-03 16:00:00', 5.2, 220),
('PKG-001', 'DELIVERED', 'Казань-Центральный',   '2024-03-04 11:30:00', 5.2, 0);
